Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: If men say evil things of you because of the name of Christ, happy are you; for the Spirit of glory and of God is resting on you.
chr: ᎢᏳᏃ ᎦᏰᏥᏐᏢᏕᏍᏗ ᎦᎶᏁᏛ ᏚᏙᎥ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ ᎣᏏᏳ ᎢᏣᎵᏍᏓᏁᏗ ᎨᏎᏍᏗ, ᎠᏓᏅᏙᏰᏃ ᎦᎸᏉᏗᏳ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎢᏤᎳᏗᏙᎭ; ᎾᏍᎩ Ꮎ ᎨᏒ ᎦᎬᏩᏐᏢᏗ, ᏂᎯᏍᎩᏂ ᎨᏒ ᎠᏥᎸᏉᏗᎭ.

source: Let no one among you undergo punishment as a taker of life, or as a thief, or as an evil-doer, or as one who is over-interested in other men's business;
chr: ᎠᏗᎾ ᏞᏍᏗ ᎩᎶ ᏂᎯ ᏂᏣᏛᏅ ᏳᎩᎵᏲᏤᏍᏗ ᏴᏫ ᎤᎸᎢ ᏳᏍᏛᏗᏍᎨᏍᏗ, ᎠᎴ ᎤᏃᏍᎩᏒᎢ, ᎠᎴ ᎤᏲ ᏚᎸᏫᏍᏓᏁᎸᎢ, ᎠᎴ ᎤᎵᏌᎳᏁᎯ ᎨᏒ ᏅᏩᎾᏓᎴ ᏧᏂᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ.

source: But if he undergoes punishment as a Christian, that is no shame to him; let him give glory to God in this name.
chr: ᎢᏳᏍᎩᏂ ᎩᎶ ᎦᎶᏁᏛ ᎠᏍᏓᏩᏗᏙᎯ ᎨᏒ ᎤᏍᏛᏗᏍᎨᏍᏗ ᎠᎩᎵᏲᎨᏍᏗ, ᏞᏍᏗ ᏯᏕᎰᏍᎨᏍᏗ, ᏫᎦᎸᏉᏓᏉᏍᎩᏂ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᏫᏂᎦᎵᏍᏙᏓ.

source: For the time has come for the judging, starting with the church of God; but if it makes a start with us, what will be the end of those who are not under the rule of God?
chr: ᎤᏍᏆᎸᎲᏰᏃ ᎾᏍᎩ ᏗᎫᎪᏙᏘ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎠᏓᏁᎸ ᎤᏓᎴᏅᏗᏱ; ᎢᏳᏃ ᎠᏴ ᏰᎦᎴᏅᏔᏅ ᎦᏙ ᎤᏍᏗ ᏭᎾᎵᏱᎶᎯᏍᏗ ᎨᏎᏍᏗ ᎾᏍᎩ Ꮎ ᏄᏃᎯᏳᏒᎾ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ.

source: And if it is hard for even the good man to get salvation, what chance has the man without religion or the sinner?
chr: ᎢᏳ ᎠᎴ ᎤᏓᏅᏘ ᎤᏎᎦᏨᎯ ᎠᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ, ᎭᏢ ᏭᎾᏄᎪᎢᏍᏗ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᏂᏚᏁᎶᏛᎾ ᎠᎴ ᎠᏍᎦᎾᎢ.

source: For this reason let those who by the purpose of God undergo punishment, keep on in well-doing and put their souls into the safe hands of their Maker.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎾᏍᎩ Ꮎ ᏄᏍᏛ ᎠᏓᏅᏖᏍᎬ ᎤᏁᎳᏅᎯ ᎠᏂᎩᎵᏲᎩ, ᏫᏓᏂᏲᎯᏏ ᏧᏍᏆᏂᎪᏙᏗᏱ ᏧᎾᏓᏅᏙ, ᎣᏍᏛ ᏕᎤᏂᎸᏫᏍᏓᏁᎲᎢ, ᎾᏍᎩᏯ ᏄᏓᎵᏓᏍᏛᎾ ᎤᏬᏢᏅᏅᎯ ᏥᏓᏂᏲᎯᏎᎰᎢ.

source: I who am myself one of the rulers of the church, and a witness of the death of Christ, having my part in the coming glory, send this serious request to the chief men among you:
chr: ᏗᎨᎦᏁᎶᏗ ᏥᎨᏣᏓᏑᏯ ᎦᏥᏔᏲᏎᎭ, ᎠᏴ ᎾᏍᏉ ᏨᏆᏁᎶᏗ ᎠᎴ ᏥᎦᏔᎯ ᏥᏌ ᎦᎶᏁᏛ ᎤᎩᎵᏲᏨᎢ, ᎠᎴ ᎾᏍᏉ ᎠᏇᏔᏗᏍᏗᏍᎩ ᎦᎸᏉᏗᏳ ᎬᏂᎨᏒ ᎢᎬᏁᏗ ᏥᎩ^

source: Keep watch over the flock of God which is in your care, using your authority, not as forced to do so, but gladly; and not for unclean profit but with a ready mind;
chr: ᏕᏤᎶᎮᏍᏗ ᎤᎾᏓᏡᎬ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ ᏥᎨᏣᏓᏑᏯ, ᏕᏥᎦᏘᏰᏍᏗ, ᎥᏞᏍᏗ ᎣᏏᏳ ᏂᏥᏰᎸᏒᎾ ᎣᏏᏳᏍᎩᏂ ᎢᏥᏰᎸᎯ ᎨᏎᏍᏗ, ᎠᎴ ᎥᏞᏍᏗ ᏧᎬᏩᎶᏗ ᎢᏥᎬᎥᏍᎬ ᏱᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ, ᎣᏏᏳᏍᎩᏂ ᎢᏥᏰᎸᏒ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ;

source: Not as lords over God's heritage, but making yourselves examples to the flock.
chr: ᎠᎴ ᏕᏥᎦᏘᏴ [ᎤᏁᎳᏅᎯ] ᏧᏤᎵᎦ ᏞᏍᏗ ᎤᏂᎬᏫᏳᎯ ᎾᎾᏛᏁᎲ ᏱᏂᏣᏛᏁᎮᏍᏗ, ᎦᎨᏣᏕᎶᏆᎡᏗᏍᎩᏂ ᎨᏎᏍᏗ ᎾᏍᎩ ᎤᎾᏓᏡᎬᎢ.

source: And at the coming of the chief Keeper of the sheep, you will be given the eternal crown of glory.
chr: ᏄᎬᏫᏳᏒᏃ ᎠᏫ-ᏗᎦᏘᏯ ᎦᎾᏄᎪᏥᎸᎭ ᎡᏥᏅᏁᏗ ᎨᏎᏍᏗ ᎦᎸᏉᏗ ᎠᎵᏍᏚᎶ ᎠᏍᎪᎸᎩ ᏂᎨᏒᎾ.

source: And in the same way, let the younger men be ruled by the older ones. Let all of you put away pride and make yourselves ready to be servants: for God is a hater of pride, but he gives grace to those who make themselves low.
chr: ᏂᎯ ᎾᏍᏉ ᎢᏥᏫᏅ ᏕᏦᎯᏳᏎᏍᏗ ᏧᎾᏛᏐᏅᎯ; ᎥᎥ, ᏂᏥᎥᎢ ᏕᏣᏓᏙᎯᏳᏎᏍᏗ, ᎠᎴ ᎢᏣᏄᏬᏍᏕᏍᏗ ᎤᏓᏙᎵᏍᏗ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒᎢ; ᎤᏁᎳᏅᎯᏰᏃ ᎤᎾᏢᏉᏗ ᏓᏡᏗᏍᎪᎢ, ᎤᎾᏓᏙᎵᏍᏗᏍᎩᏂ ᎬᏩᎦᏗᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏓᎵᏍᎪᎸᏓᏁᎰᎢ.

source: For this cause make yourselves low under the strong hand of God, so that when the time comes you may be lifted up;
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏣᏓᏙᎵᏍᏗ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᎤᎵᏂᎩᏛ ᎤᏬᏰᏂ ᎭᏫᏂᏗᏢ ᏂᏣᏛᎾᏕᎬᎢ, ᎾᏍᎩᏃ ᎨᏥᏌᎳᏙᏗ ᎨᏎᏍᏗ ᎠᏎᎸᎯ ᎨᏒ ᎾᎯᏳᎢ.

source: Putting all your troubles on him, for he takes care of you.
chr: ᎠᎴ ᎾᏍᎩ ᏂᎦᏗᏳ ᎤᏪᎵᎯᏍᏗ ᎢᏤᎲ ᏤᏥᏲᎯᏏ, ᎾᏍᎩᏰᏃ ᎢᏣᏓᏅᏖᏍᎪᎢ.

source: Be serious and keep watch; the Evil One, who is against you, goes about like a lion with open mouth in search of food;
chr: ᎢᏣᎵᏏᎾᎯᏍᏗ ᎨᏎᏍᏗ, ᎢᏥᏯᏫᏍᎨᏍᏗ, ᎢᏣᏡᏗᏍᎩᏰᏃ ᎠᏍᎩᎾ, ᏢᏓᏥ ᎤᏃᏕᎾ ᎤᏪᎷᎩ ᎾᏍᎩᏯ ᎡᏙᎭ ᏚᏲᎭ ᏧᏪᏰᏍᏗ.

source: Do not give way to him but be strong in your faith, in the knowledge that your brothers who are in the world undergo the same troubles.
chr: ᎾᏍᎩ ᏤᏣᏟᏴᏏ, ᎤᎵᏂᎩᏛ ᎨᏎᏍᏗ ᎢᏦᎯᏳᏒᎢ, ᎢᏥᎦᏔᎭᏰᏃ ᎤᏠᏱ ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒ ᎠᏂᎧᎵᎢᎲ ᎢᏣᎵᏅᏟ ᎡᎶᎯ ᏣᏁᎭ.

source: And after you have undergone pain for a little time, the God of all grace who has given you a part in his eternal glory through Christ Jesus, will himself give you strength and support, and make you complete in every good thing;
chr: ᎠᏗᎾ ᎤᏁᎳᏅᎯ ᎤᏣᏔᏅᎯ ᎤᏓᏙᎵᏣᏘ ᎾᏍᎩ ᎢᎩᏯᏅᏛ ᏥᎩ ᎤᏤᎵ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎦᎸᏉᏗᏳ ᎨᏒ ᏫᎩᎷᎯᏍᏗᏱ, ᏥᏌ ᎦᎶᏁᏛ ᎠᎬᏗᏍᎬᎢ, ᎾᏍᎩ ᏞᎦ ᎢᏥᎩᎵᏲᏨᎯ ᎨᏎᏍᏗ, ᏂᏥᎪᎸᎾ ᏫᏂᏨᎦ, ᎠᎴ ᏫᏣᎵᏂᎪᎯᏍᏓ, ᎠᎴ ᎢᏣᎵᏂᎩᏛ ᏫᏂᏨᎦ, ᎠᎴ ᎦᏰᏥᏖᎸᏗ ᏂᎨᏒᎾ ᏫᏂᏨᎦ.

source: His is the power for ever. So be it.
chr: ᎾᏍᎩ ᎤᏤᎵ ᎨᏎᏍᏗ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᎤᎬᏫᏳᎯ ᎨᏒ ᏂᎪᎯᎸ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ. ᎡᎺᏅ.

source: I have sent you this short letter by Silvanus, a true brother, in my opinion; comforting you and witnessing that this is the true grace of God; keep to it.
chr: ᎢᏨᏲᏪᎳᏏ ᎦᏲᎵ ᏏᎷᏪᏂ ᎤᏅᏍᏗ ᎾᏍᎩ ᎦᎳᏏᏛᏗ ᏂᎨᏒᎾ ᎢᏣᎵᏅᏟ ᎦᏓᏅᏖᏍᎬᎢ, ᎢᏒᏔᏲᏎᎭ, ᎠᎴ ᎬᏂᎨᏒ ᏂᏨᏴᏁᎭ ᎾᏍᎩ ᎯᎠ ᎾᎿ ᏥᏕᏥᏙᎦ ᎤᏙᎯᏳᏒ ᎤᏁᎳᏅᎯ ᎤᏓᏙᎵᏍᏗ ᎨᏒᎢ.

source: She who is in Babylon, who has a part with you in the purpose of God, sends you her love; and so does my son Mark.
chr: ᏓᏓᎶᏂ ᎠᏁᎯ ᎨᎦᏑᏰᏛ ᏂᎯ ᎡᏣᏑᏰᏛ ᎨᏒ ᎾᏍᎩᏯᎢ ᏫᎨᏥᏲᎵᎭ, ᎠᎴ ᎾᏍᏉ ᎹᎦ ᎠᏇᏥ.

source: Give one another the kiss of love. Peace be to you all in Christ.
chr: ᏕᏣᏓᏲᎵᎸᎭ ᎢᏨᏔᏅᎭ ᎠᏓᎨᏳᏗ ᏗᏓᏙᏪᏙᎥᏍᏗ ᎨᏒᎢ. ᏅᏩᏙᎯᏯᏛ ᎢᏤᎳᏗᏙᎮᏍᏗ ᏂᏥᎥ ᏥᏌ ᎦᎶᏁᏛ ᎡᏥᏯᎢ. ᎡᎺᏅ

source: Second Epistle of Peter
chr: ᏈᏓ ᏔᎵᏁ ᎤᏬᏪᎳᏅᎯ

source: Simon Peter, a servant and Apostle of Jesus Christ, to those who with us have a part in the same holy faith in the righteousness of our God and Saviour Jesus Christ:
chr: ᎠᏴ ᏌᏩᏂ ᏈᏓ, ᎠᎸᎾᏝᎢ ᎠᎴ ᎠᎩᏅᏏᏛ ᏥᏌ ᎦᎶᏁᏛ, ᎦᏥᏲᏪᎳᏏ ᎾᏍᎩ Ꮎ ᎨᏥᏁᎸᎯ ᏥᎩ ᎣᎩᏁᎸ ᎾᏍᎩᏯᎢ, ᎦᎸᏉᏗᏳ ᎪᎯᏳᏗ ᎨᏒ ᏅᏓᏳᏓᎴᏅᏁ ᎤᏓᏅᏘᏳ ᎨᏒ ᎢᎦᏁᎳᏅᎯ ᎠᎴ ᎢᎩᏍᏕᎵᏍᎩ ᏥᏌ ᎦᎶᏁᏛ.

source: May grace and peace ever be increasing in you, in the knowledge of God and of Jesus our Lord;
chr: ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎡᏥᏁᏉᎡᏗ ᎨᏎᏍᏗ ᏅᏓᏳᏓᎴᏅᎯ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎤᏁᎳᏅᎯ ᎠᎴ ᏥᏌ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ.

source: Because by his power he has given us everything necessary for life and righteousness, through the knowledge of him who has been our guide by his glory and virtue;
chr: ᎾᏍᎩᏯ ᎤᏤᎵ ᎤᎵᏂᎩᏗ ᎨᏒ ᎤᏩᏔᏅᎢ ᎢᎩᏁᎸᎯ ᏥᎩ ᏄᏓᎴᏒ ᎪᎱᏍᏗ ᏕᏛᏅ ᎤᎬᏩᎵ ᎠᎴ ᎤᏁᎳᏅᎯ ᎦᎾᏰᎯᏍᏗ ᎨᏒ ᎤᎬᏩᎵ, ᏅᏓᏳᏓᎴᏅᎯ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎾᏍᎩ Ꮎ ᎢᎩᏯᏅᏛ ᏥᎩ ᎬᏔᏅᎯ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᏚᏳᎪᏛ ᎢᏍᏛᏁᏗ ᎨᏒᎢ.

source: And through this he has given us the hope of great rewards highly to be valued; so that by them we might have our part in God's being, and be made free from the destruction which is in the world through the desires of the flesh.
chr: ᎤᏍᎩ ᎾᎿ ᏭᏓᎪᎾᏛᏔᏅᎯ ᎡᏉᎯᏳ ᎠᎴ ᎦᎸᏉᏗᏳ ᎡᎩᏚᎢᏍᏓᏁᎸᎯ ᏥᎩ, ᎾᏍᎩ ᎯᎠ ᏕᏨᏗᏍᎬ ᎨᏣᏠᏯ ᏍᏙᏗ ᏱᏂᎦᎵᏍᏓ ᎤᏁᎳᏅᎯ ᏄᏍᏛᎢ, ᎡᏣᏗᏫᏎᎸᎯ ᎨᏒ ᎤᏲᎢ ᎡᎶᎯ ᏤᎭ ᎠᏚᎸᏗ ᎨᏒ ᏨᏗᏓᎴᎲᏍᎦ.

source: So, for this very cause, take every care; joining virtue to faith, and knowledge to virtue,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏣᏘ ᎢᎶᏟᏂᎬᏁᎲ ᎢᏦᎯᏳᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒᎢ; ᎠᎴ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒᎢ;

source: And self-control to knowledge, and a quiet mind to self-control, and fear of God to a quiet mind,
chr: ᎠᎦᏙᎥᎯᏍᏗᏃ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᎠᎵᏏᎾᎯᏍᏙᏗ ᎨᏒᎢ; ᎠᎵᏏᎾᎯᏍᏙᏗᏃ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᏗᏨᏂᏗᏳ ᎨᏒᎢ; ᏗᏨᏂᏗᏳᏃ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᎤᏁᎳᏅᎯ ᎦᎾᏰᎯᏍᏗ ᎨᏒᎢ;

source: And love of the brothers to fear of God, and to love of the brothers, love itself.
chr: ᎤᏁᎳᏅᎯᏃ ᎦᎾᏰᎯᏍᏗ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᎠᎾᎵᏅᏢ ᏗᎨᏳᏗ ᎨᏒᎢ; ᎠᎾᎵᏅᏢᏃ ᏗᎨᏳᏗ ᎨᏒ ᏔᎵ ᎢᏨᏗᏍᎨᏍᏗ ᎢᎬᏂᎢᏛᏉ ᏗᎨᏳᏗ ᎨᏒᎢ.

source: For if you have these things in good measure, they will make you fertile and full of fruit in the knowledge of our Lord Jesus Christ.
chr: ᎢᏳᏰᏃ ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ ᎣᏤᎭ ᎠᎴ ᏱᎧᏁᏉᎦ, ᎾᏍᎩ ᏱᏂᎬᏂᏌ ᎥᏝ ᎢᏥᏍᎦᏃᎸ ᎠᎴ ᏂᏥᏁᏉᏣᏛᎾ ᏱᎦᎩ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᏥᏌ ᎦᎶᏁᏛ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵᎦ.

source: For the man who has not these things is blind, seeing only what is near, having no memory of how he was made clean from his old sins.
chr: ᏄᏪᎲᎾᏍᎩᏂ ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ ᎾᏍᎩ ᏗᎨᏫᏉ ᎠᎴ ᎢᏴᏛ ᎬᏩᎪᏩᏛᏗ ᏂᎨᏒᎾ, ᎠᎴ ᎤᏩᎨᏫᏒᎯ ᎠᏥᏅᎦᎸᏛ ᎨᏒ ᎢᎸᎯᏳ ᎤᏍᎦᏅᏥᏙᎸᎢ.

source: For this reason, my brothers, take all the more care to make your selection and approval certain; for if you do these things you will never have a fall:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏓᎵᏅᏟ ᎤᏟ ᎢᎦᎢ ᎢᏣᏟᏂᎬᏁᎮᏍᏗ ᏄᏜᏏᏛᏒᎾ ᎢᏨᏁᏗᏱ ᎡᏥᏯᏅᎲ ᎠᎴ ᎡᏣᏑᏰᏒᎢ; ᎢᏳᏰᏃ ᎯᎠ ᎾᏍᎩ ᏧᏓᎴᏅᏛ ᏱᏂᏣᏛᏁᎭ, ᎥᏝ ᎢᎸᎯᏳ ᏱᏙᎨᏥᏅᎩ.

source: For so the way will be open to you into the eternal kingdom of our Lord and Saviour Jesus Christ.
chr: ᎾᏍᎩᏰᏃ ᏂᏣᏛᏁᎲ ᎤᏣᏔᏅᎯ ᎡᏥᏁᏗ ᎨᏎᏍᏗ ᎢᏥᏴᏍᏗᏱ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎤᎬᏫᏳᎯ ᏗᎨᏒ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ ᎠᎴ ᎢᎩᏍᏕᎵᏍᎩ ᏥᏌ ᎦᎶᏁᏛ.

source: For this reason I will be ready at all times to keep your memory of these things awake, though you have the knowledge of them now and are well based in your present faith.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎥᏝ ᎤᏁᎳᎩ ᏴᏓᎨᎵᏏ ᏂᎪᎯᎸ ᎢᏨᏯᏅᏓᏗᏍᏙᏗᏱ ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ, ᎢᏥᎦᎳᎭᏍᎩᏂᏃᏅ, ᎠᎴ ᏕᏣᎵᏂᎪᏒ ᎾᎿ ᏚᏳᎪᏛ ᎨᏒ ᎪᎯ ᏥᏣᏛᎩᎭ.

source: And it seems right to me, as long as I am in this tent of flesh, to keep your minds awake by working on your memory;
chr: ᎥᎥ, ᏚᏳᎪᏗ ᎨᎵᎭ ᎢᎪᎯᏛ ᎠᏂ ᎯᎠ ᎦᎵᏦᏛ ᏥᏯᎥᎢ, ᎢᏨᏰᏍᏛᏙᏗᏱ ᎢᏨᏯᏅᏓᏗᏍᏗᏍᎬᎢ;

source: For I am conscious that in a short time I will have to put off this tent of flesh, as our Lord Jesus Christ has made clear to me.
chr: ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᏥᎦᏔᎲ ᏂᎪᎯᎸᎾᏉ ᎢᏴᏛ ᎠᎩᏗᏱ ᎨᏒ ᎠᏆᏤᎵ ᎦᎵᏦᏛᎢ, ᎾᏍᎩᏯ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᏥᏌ ᎦᎶᏁᏛ ᎬᏂᎨᏒ ᎾᏋᏁᎸᎢ.

source: And I will take every care so that you may have a clear memory of these things after my death.
chr: ᎠᎴ ᏓᎦᏟᏂᎬᏁᎵ ᎠᎩᎶᏐᏅᎯ ᎨᏎᏍᏗ ᏂᎪᎯᎸ ᎨᏨᎨᏫᏍᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ.

source: For when we gave you news of the power and the coming of our Lord Jesus Christ, our teaching was not based on stories put together by art, but we were eye-witnesses of his glory.
chr: ᎥᏝᏰᏃ ᎠᎵᏏᎾᎯᏍᏔᏅᎯ ᎠᏎᏉ ᎦᏬᏂᎯᏍᏗ ᎨᏒ ᏲᎩᏍᏓᏩᏛᏎ ᎬᏂᎨᏒ ᏂᏨᏴᏁᎸ ᎤᎵᏂᎩᏗ ᎨᏒ ᎠᎴ ᎤᎷᎯᏍᏗ ᎨᏒ ᎢᎦᏤᎵ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ; ᏱᎩᎪᎲᎯᏍᎩᏂ ᎨᏒᎩ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏤᎵᎦ.

source: For God the Father gave him honour and glory, when such a voice came to him out of the great glory, saying, This is my dearly loved Son, with whom I am well pleased.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎠᎦᏴᎵᎨ ᎤᎵᏍᎪᎸᏓᏁᎸᎩ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᎢᎦᏚᎸᏌᏛᎢ, ᎾᎯᏳ ᎧᏁᎬ ᏧᎷᏤᎸ ᎤᏣᏘ ᎦᎸᏉᏗᏳ ᎢᎦ-ᏚᎸᏌᏛ ᏅᏓᏳᏓᎴᎤᎯ, [ᎯᎠ ᏥᏂᎦᏪᏍᎬᎩ,] ᎯᎠ ᏥᎨᏳᎢ ᎠᏇᏥ, ᎾᏍᎩ ᎣᏏᏳ ᏥᏰᎸᎢ ᏥᎩ.

source: And this voice came from heaven even to our ears, when we were with him on the holy mountain.
chr: ᎾᏍᎩᏃ ᎯᎠ ᎤᏁᏨ ᎦᎸᎳᏗ ᏅᏓᏳᎶᏒᎯ ᎣᎦᏛᎦᏅᎩ, ᎾᎯᏳ ᎦᎸᏉᏗ ᎣᏓᎸ ᎢᏧᎳᎭ ᎣᏤᏙᎲᎢ.

source: And so the words of the prophets are made more certain; and it is well for you to give attention to them as to a light shining in a dark place, till the dawn comes and the morning star is seen in your hearts;
chr: ᎠᎴ ᎾᏍᏉ ᎤᏟ ᎢᎦᎢ ᏄᏜᏏᏛᏒᎾ ᎧᏃᎮᏛ ᎠᏙᎴᎰᏒᎯ ᎢᎩᎭ, ᎾᏍᎩ ᎣᏏᏳ ᏱᏂᏣᏛᎦ ᏱᏣᎦᏌᏯᏍᏔᏅ ᎾᏍᎩᏯ ᎢᎦ-ᏚᎸᏌᏛ ᎤᎵᏏᎬ ᏨᎦᏌᏯᏍᏗᏍᎪᎢ, ᎬᏂ ᎢᎦ ᏓᎦᏙᎩ, ᎠᎴ ᏑᎾᎴ ᎡᎯ ᏃᏈᏏ ᏓᎧᎸᎩ ᏗᏥᎾᏫᏱ;

source: Being conscious in the first place that no man by himself may give a special sense to the words of the prophets.
chr: ᎢᎬᏱ ᎾᏍᎩ ᎯᎠ ᏂᏥᎦᏙᎥᏎᏍᏗ ᎾᏍᎩ ᏌᏉ ᎤᏅ ᎠᏙᎴᎰᏒᎯ ᎪᏪᎸᎢ ᎤᏩᏒ ᎨᏒ ᏗᎬᏁᏢᏙᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: For these words did not ever come through the impulse of men: but the prophets had them from God, being moved by the Holy Spirit.
chr: ᎤᎾᏙᎴᎰᏒᏰᏃ ᎢᎸᎯᏳ ᏥᎨᏎᎢ ᎥᏝ ᏴᏫᏉ ᎠᏓᏅᏖᏍᎬ ᏴᏗᏓᎴᏁᎢ; ᎠᏃᏍᏛᏍᎩᏂ ᎠᏂᏍᎦᏯ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ ᎠᏂᏁᎨ ᎢᏳᏂᏪᏍᏗᏱ ᏄᏅᏁᎲ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ.

source: But there were false prophets among the people, as there will be false teachers among you, who will secretly put forward wrong teachings for your destruction, even turning away from the Lord who gave himself for them; whose destruction will come quickly, and they themselves will be the cause of it.
chr: ᎠᏎᏃ ᎤᎾᏠᎾᏍᏗ ᎠᎾᏙᎴᎰᏍᎩ ᎢᎬᏩᎾᏓᏑᏰ ᏴᏫ, ᎾᏍᎩᏯ ᎤᎾᏠᎾᏍᏗ ᏗᎾᏕᏲᎲᏍᎩ ᎨᏣᏓᏑᏴᏗ ᏥᎩ, ᎾᏍᎩ ᎤᏕᎵᏛ ᎤᏂᏴᏔᏂᎯᏍᏗ ᎨᏎᏍᏗ ᎤᎾᏓᏤᎵᏛ ᎨᏒ ᎠᏓᏛᏗᏍᎩ, ᎾᏍᎩ ᎠᎾᏓᏱᎮᏍᏗ ᎤᎬᏫᏳᎯ ᎤᎾᎫᏴᏛ, ᎠᎴ ᎤᏅᏒ ᎢᏳᏅᏂᏌᏛ ᎤᏂᎷᏤᏗ ᎨᏎᏍᏗ ᏞᎩᏳ ᎤᏂᏛᏗᏍᎩ.

source: And a great number will go with them in their evil ways, through whom the true way will have a bad name.
chr: ᎠᎴ ᎤᏂᏣᏖᏍᏗ ᏛᏂᏍᏓᏩᏕᏏ ᎾᏍᎩ ᎤᎾᏤᎵ ᎠᏓᏛᏗᏍᎩ; ᎾᏍᎩ ᏅᏛᏅᏂᏌᏂ ᏚᏳᎪᏛ ᏅᏃᎯ ᎤᏂᏐᏢᎢᏍᏙᏗ ᎨᏎᏍᏗ.

source: And in their desire for profit they will come to you with words of deceit, like traders doing business in souls: whose punishment has been ready for a long time and their destruction is watching for them.
chr: ᎠᎴ ᏧᎬᏩᎶᏗ ᎤᏂᎬᎥᏍᎬ ᎢᏳᏍᏗ, ᎠᎴ ᎦᎶᏄᎮᏛ ᎠᏅᏗᏍᎬ ᎠᏂᏬᏂᏍᎬ ᎦᏃᏙᏗ ᏓᎨᏥᏰᎸᏥ; ᎾᏍᎩ ᏧᎾᏚᎪᏓᏁᏗ ᎨᏒ ᎡᏘ ᏅᏓᎬᏩᏓᎴᏅᏛ ᎥᏝ ᏯᎵᎾᎯᏍᏗᎭ, ᎠᎴ ᎤᏂᏛᏗᏍᎩ ᎥᏝ ᏱᎦᎸᏍᎦ.

source: For if God did not have pity for the angels who did evil, but sent them down into hell, to be kept in chains of eternal night till they were judged;
chr: ᎤᏁᎳᏅᎯᏰᏃ ᏂᏚᎨᏳᏅᎾ ᏥᎨᏎ ᏗᏂᎧᎾᏩᏗᏙᎯ ᎤᏂᏍᎦᏅᏨᎯ, ᏨᏍᎩᏃᏉᏍᎩᏂ ᏥᏫᏚᏓᎢᏅᏎᎢ, ᎠᎴ ᏥᏚᏲᏎ ᏧᏓᏕᏒᏛ ᏗᎨᎦᎸᏍᏙᏗᏱ ᎤᎵᏏᎬ ᎨᏥᏍᏆᏂᎪᏙᏗᏱ ᏗᎨᎫᎪᏓᏁᏗ ᎨᏒ ᎢᏳᎢ,

source: And did not have mercy on the world which then was, but only kept safe Noah, a preacher of righteousness, with seven others, when he let loose the waters over the world of the evil-doers;
chr: ᎠᎴ ᏄᎨᏳᏅᎾ ᏥᎨᏎ ᎡᏘ ᎡᎶᎯ ᏥᎨᏎᎢ, ᏃᏯᏍᎩᏂ ᏧᏁᎳ ᏧᏛᏕᎢ ᎨᏒ ᎾᏍᎩ ᎠᎵᏥᏙᎲᏍᎩ ᏚᏳᎪᏛ ᏗᎧᎾᏩᏗᏙᎯ ᏥᎨᏎᎢ, ᎠᎴ ᏥᏚᏃᎱᎪᏔᏁ ᎡᎶᎯ ᎠᏂᏍᎦᎾ ᎠᏁᎲᎢ,

source: And sent destruction on Sodom and Gomorrah, burning them up with fire as an example to those whose way of life might in the future be unpleasing to him;
chr: ᏐᏓᎻᏃ ᎠᎴ ᎪᎹᎵ ᏕᎦᏚᎲ ᎪᏍᏚ ᏥᏂᏚᏩᏁᎴᎢ, ᎠᎴ ᏥᏚᏭᎪᏓᏁᎴ ᏧᎷᏆᏗᏅᏗᏱ, ᎠᎴ ᎾᏍᎩ ᎤᏁᏯᏔᎲᏍᎩ ᏥᏂᏚᏩᏁᎴ ᎣᏂ ᎤᎾᏕᏗ ᎤᏁᎳᏅᎯ ᏂᏚᎾᏁᎶᏛᎾ ᎨᏒᎢ,

source: And kept safe Lot, the upright man, who was deeply troubled by the unclean life of the evil-doers
chr: ᎠᎴ ᎶᏗ ᎤᏓᏅᏘ ᏧᏭᏓᎴᏎᎢ, ᎤᏕᏯᏔᏁᎸ ᏄᎾᎵᏏᎾᎯᏍᏛᎾ ᎠᏁᎲ ᎠᏂᏍᏚᎾᎢ.

source: (Because the soul of that upright man living among them was pained from day to day by seeing and hearing their crimes):
chr: (ᎾᏍᎩᏰᏃ ᎤᏓᏅᏘ ᎠᏍᎦᏯ ᎠᏁᎲ ᏤᎮᎢ, ᎠᎪᏩᏘᏍᎬ ᎠᎴ ᎠᏛᎩᏍᎬ [ᏄᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ] ᎤᏓᏅᏘ ᎤᏓᏅᏙ ᏂᏚᎩᏨᏂᏒ ᎤᏕᏯᏙᏗ ᎤᏓᏅᏖ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏂᏚᏳᎪᏛᎾ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ,)

source: The Lord is able to keep the upright safe in the time of testing, and to keep evil-doers under punishment till the day of judging;
chr: ᎤᎬᏫᏳᎯ ᎠᎦᏔᎭ ᎢᏳᏛᏁᏗᏱ ᏧᏭᏓᎴᏍᏗᏱ ᎤᎾᏓᏅᏘ ᎤᏂᎪᎵᏰᏍᎩ ᎤᏂᏰᎢᎵᏙᎲᎢ, ᎤᏂᏲᏃ ᏧᏍᏆᏂᎪᏙᏗᏱ ᎨᏥᎩᎵᏲᎢᏍᏙᏗᏱ ᏗᎫᎪᏙᏗᏱ ᎢᎦ ᎨᏎᏍᏗ:

source: But specially those who go after the unclean desires of the flesh, and make sport of authority. Ready to take chances, uncontrolled, they have no fear of saying evil of those in high places:
chr: ᎠᎴ ᎾᏍᎩ Ꮀ ᎤᎬᏫᏳᎭ [ᎨᏂᎩᎵᏲᎢᏍᏙᏗ ᎨᏎᏍᏗ] ᎤᏇᏓᎵ ᎠᏂᏍᏓᏩᏕᎩ ᎤᏂᎬᎥᏍᎬ ᎦᏓᎭ ᎨᏒᎢ, ᎠᎴ ᏗᏂᏍᎦᎩ ᏄᏂᎬᏫᏳᏌᏕᎩ. ᎤᏂᏍᎦᎢᏍᏗ, ᎤᏅᏒ ᎠᎾᏓᏅᏖᏍᎬ ᎤᏂᎸᏉᏗ; ᎥᏝ ᏯᏂᏍᎦᎢᎭ ᏗᎬᏩᏂᏐᏢᏙᏗᏱ ᎨᏥᎸᏉᏗ.

source: Though the angels, who are greater in strength and power, do not make use of violent language against them before the Lord.
chr: ᏗᏂᎧᎿᏩᏗᏙᎯᏍᎩᏂ ᎤᏟ ᎢᏧᎾᎵᏂᎩᏛ ᏥᎩ ᎥᏝ ᎪᎱᏍᏗ ᎤᏐᏅ ᏱᏓᏂᎳᏫᏎᎰ ᎤᎬᏫᏳᎯ ᎠᎦᏔᎲᎢ.

source: But these men, like beasts without reason, whose natural use is to be taken and put to death, crying out against things of which they have no knowledge, will undergo that same destruction which they are designing for others;
chr: ᎯᎠᏍᎩᏂ ᎾᏍᎩᏯ ᎪᎱᏍᏗᏉ ᏤᎿᎠ ᎨᎪᏢᏅᎯ ᎨᎨᎢᏍᏗᏱ ᎠᎴ ᎨᏥᏛᏙᏗᏱ, ᎾᏍᎩ ᎠᏂᏐᏢᎢᏍᏗᎪ ᏧᏓᎴᏅᏛ ᎾᏃᎵᎬᎾ ᎨᏒᎢ, ᎠᎴ ᏛᎾᎵᏛᏔᏂ ᎤᏅᏒ ᎤᏂᏲᎢᏳ ᎨᏒᎢ.

source: For the evil which overtakes them is the reward of their evil-doing: such men take their pleasure in the delights of the flesh even in the daytime; they are like the marks of a disease, like poisoned wounds among you, feasting together with you in joy;
chr: ᎠᎴ ᏛᏂᏩᏛᎯ ᎨᎦᎫᏴᏓᏁᏗ ᏂᏚᏳᎪᏛᎾ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ, ᎾᏍᎩᏯ [ᎨᎦᎫᏴᏓᏁᏗ ᏥᎩ] ᎣᏏᏳ ᎤᏥᏰᎸᎯ ᎢᎦ ᎨᏒ ᎣᏍᏛ ᏧᎾᎵᏍᏓᏴᏗᏱ. ᏥᏚᏓᏓᎶᎢ ᎠᎴ ᎪᎱᏍᏗ ᏧᏍᏙᎢ ᎾᏍᎩᏯᎢ, ᎣᏏᏳ ᎤᏂᏰᎸᎭ ᎤᏅᏒ ᎠᎾᏓᎵᏓᏍᏗᏍᎬᎢ, ᎾᎯᏳ ᎢᏧᎳᎭ ᎢᏣᎵᏍᏓᏴᎲᏍᎬᎢ.

source: Having eyes full of evil desire, never having enough of sin; turning feeble souls out of the true way; they are children of cursing, whose hearts are well used to bitter envy;
chr: ᏗᏂᎦᏙᎵ ᏧᎧᎵᏨᎯ ᎠᏓᏲᏁᏗ ᎨᏒᎢ, ᎠᎴ ᏗᎬᏩᏂᏲᎯᏍᏗ ᏂᎨᏒᎾ ᎠᏍᎦᏂ ᎨᏒᎢ: ᏗᏂᎶᏄᎮᏍᎩ ᏂᏚᎾᎵᏂᎬᎬᎾ ᎦᎾᏓᏅᏛᎢ; ᏧᏂᎾᏫ ᏧᎩᏌᏛ ᎠᎬᎥᎯᏍᏗ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ; ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒ ᏧᏪᏥ,

source: Turning out of the true way, they have gone wandering in error, after the way of Balaam, the son of Beor, who was pleased to take payment for wrongdoing;
chr: ᎤᏅᏕᏨ ᏚᏳᎪᏛ ᎦᏅᏅᎢ, ᎠᎴ ᎤᎾᎴᏲᎥ, ᎤᏂᏍᏓᏩᏕᏅ ᎤᎶᏒ ᏇᎳᎻ ᏉᏌ ᎤᏪᏥ, ᎣᏏᏳ ᏧᏰᎸᏎ ᏂᏚᏳᎪᏛᎾ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎠᎫᏴᏗ,

source: But his wrongdoing was pointed out to him: an ass, talking with a man's voice, put a stop to the error of the prophet.
chr: ᎠᏎᏃ ᎠᏥᎬᏍᎪᎸᏁ ᎤᏍᎦᏅᏨᎢ: ᎤᏩᎨᏫ ᏗᎦᎵᎠᏅᎯᏛ ᏴᏫ ᎤᏁᎢᏍᏗ ᎤᏩᏔᏁ ᎤᏁᏤᎢ, ᎤᏍᎦᏤ ᏄᏓᏅᏛᎾ ᎨᏒ ᎠᏙᎴᎰᏍᎩ.

source: These are fountains without water, and mists before a driving storm; for whom the eternal night is kept in store.
chr: ᎯᎠ ᎾᏍᎩ ᏓᏔᎴᏒ ᎠᎹ-ᏗᏢᏗᏱ ᎠᎹ ᏂᏗᎦᏁᎲᎾ, [ᎠᎴ] ᎤᎶᎩᎸ ᎤᏃᎴ ᏧᏃᎸᏔᏂᏙᎰᎢ, ᎾᏍᎩ Ꮎ ᎬᎾᎨ ᎤᎵᏏᎬ ᏥᎨᎦᏛᏅᎢᏍᏓᏁᎸ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ.

source: For with high-sounding false words, making use of the attraction of unclean desires of the flesh, they get into their power those newly made free from those who are living in error;
chr: ᎠᏂᏁᎩᏰᏃ ᎤᏣᏘ ᎠᏢᏆᏍᏗ ᎪᎱᏍᏗ ᎬᏙᏗ ᏂᎨᏒᎾ ᎠᏂᏬᏂᏍᎬᎢ, ᏓᏂᎶᏄᎮᏍᎪ ᎠᏅᏗᏍᎪ ᎤᏇᏓᎵ ᎠᏚᎸᏗ ᎨᏒᎢ, [ᎠᎴ] ᏃᎵᏏᎾᎯᏍᏛᎾ ᏂᏓᏍᏗ ᎨᏒᎢ, ᎾᏍᎩ ᎤᏙᏗᏳᎯ ᏧᎾᏗᏫᏎᎸᎯ ᎾᏍᎩ Ꮎ ᎠᏏ ᎤᏓᎵᏓᏍᏗ ᎨᏒ ᎠᎾᎴᏂᏙᎯ ᏥᎩ.

source: Saying that they will be free, while they themselves are the servants of destruction; because whatever gets the better of a man makes a servant of him.
chr: ᏓᏂᏚᎢᏍᏓᏁᎰ ᏗᎨᏥᎾᏝᎢ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᎤᏅᏒᏃ ᎤᏲ ᎨᏒ ᏗᎬᏩᏂᎾᏝᎢ ᎨᏐᎢ: ᎩᎶᏰᏃ ᎠᏥᏎᎪᎩ ᎾᏍᎩ Ꮎ ᎤᏎᎪᎩᏛ ᎤᎾᏝᎢ ᏂᎦᎵᏍᏗᏍᎪᎢ.

source: For if, after they have got free from the unclean things of the world through the knowledge of the Lord and Saviour Jesus Christ, they are again taken in the net and overcome, their last condition is worse than their first.
chr: ᎢᏳᏰᏃ ᎤᎾᏗᏫᏎᎸᎯ ᏱᎩ ᎦᏓᎭ ᎨᏒ ᎡᎶᎯ ᎡᎯ, ᎠᏅᏗᏍᎬ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎤᎬᏫᏳᎯ ᎠᎴ ᎢᎩᏍᏕᎵᏍᎩ ᏥᏌ ᎦᎶᏁᏛ, ᏔᎵᏁᏃ ᏱᎤᏁᏒ ᎾᎿᏂ ᎠᎴ ᏱᎨᏥᏎᎪᎩᏒ, ᎤᎵᏍᏆᎸᏗ ᏄᎾᎵᏍᏓᏁᎸ ᎤᏟ ᎤᏲᎢᏳ ᎡᏍᎦᏉ ᎢᎬᏱᏱ.

source: For it would have been better for them to have had no knowledge of the way of righteousness, than to go back again from the holy law which was given to them, after having knowledge of it.
chr: ᎤᏟᏰᏃ ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᏱᎨᏎᎢ ᏄᏂᎦᏙᎥᏒᎾ ᏱᎨᏎ ᏚᏳᎪᏛ ᎦᏅᏅᎢ, ᎠᏃ ᎤᏂᎦᏙᎥᏒᎯ ᎨᏒ ᏯᎾᎦᏔᎲ ᏱᏚᏂᏲᏍᎦ ᎦᎸᏉᏗᏳ ᏗᎧᎿᏩᏛᏍᏗ ᎾᏍᎩ ᏗᎨᏥᏲᎯᏎᎸᎯ.

source: They are an example of that true saying, The dog has gone back to the food it had put out, and the pig which had been washed to its rolling in the dirty earth.
chr: ᎠᏎᏃ ᎾᏍᎩᏯ ᏄᎾᎵᏍᏓᏁᎸ ᎯᎠ ᎤᏙᎯᏳᎯ ᎢᎦᏪᏛ ᏥᎩ, ᎩᎵ ᎤᏩᏒ ᏚᎵᎦᏍᏔᏅ ᏔᎵᏁ ᏮᎠᎦᏔᎲᏍᏓ; ᏏᏉᏃ ᎠᎪᏑᎴᎥᎯ ᎤᏓᏬᏍᏗᏱ ᏝᏬᏚᎯ ᏮᎠᎦᏔᎲᏍᏓ.

source: My loved ones, this is now my second letter to you, and in this as in the first, I am attempting to keep your true minds awake;
chr: ᎯᎠ ᎾᏍᎩ ᏔᎵᏁ ᎪᏪᎵ ᎿᏉ ᎢᏨᏲᏪᎳᏏ ᎢᏨᎨᏳᎢ; ᎾᏍᎩ ᎾᎿ ᏕᏨᏰᏍᏓᏁ ᎤᏠᎾᏍᏗ ᏂᎨᏒᎾ ᏕᏣᏓᏅᏛ ᎾᏍᎩ ᎢᏨᏯᏅᏓᏗᏍᏗᏍᎬᎢ,

source: So that you may keep in mind the words of the holy prophets in the past, and the law of the Lord and Saviour which was given to you by his Apostles.
chr: ᎾᏍᎩ ᎢᏣᏅᏓᏗᏍᏗᏱ ᎧᏃᎮᏛ ᎢᎸᎯᏳ ᎤᏂᏃᎮᏛ ᎨᏥᎸᏉᏗ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᎠᏴ ᏦᎦᏕᏲᏅᎯ ᎣᎩᏅᏏᏛ ᎤᎬᏫᏳᎯ ᎠᎴ ᏗᏍᏕᎵᏍᎩ.

source: Having first of all the knowledge that in the last days there will be men who, ruled by their evil desires, will make sport of holy things,
chr: ᎯᎠ ᏄᏍᏕᏍᏗ ᎢᎬᏱ ᎢᏣᏅᏖᏍᏗ, ᎾᏍᎩ ᎤᎵᏍᏆᏅᏗ ᎨᏎᏍᏗ ᎤᏂᎷᎯᏍᏗ ᎨᏒ ᎠᏂᏐᏢᎢᏍᏗᏍᎩ ᎤᏅᏒ ᎤᎾᏚᎸᏅᎥᏍᎬ ᎠᏂᏍᏓᏩᏕᎩ,

source: Saying, Where is the hope of his coming? From the death of the fathers till now everything has gone on as it was from the making of the world.
chr: ᎠᎴ ᎯᎠ ᎢᏯᏂᏪᏍᎩ, ᎦᏙ ᎤᎵᏍᏔᏅ ᎤᎷᎯᏍᏗᏱ ᎤᏚᎢᏍᏔᏅᎢ? ᎠᏂᎦᏴᎵᎨᏰᏃ ᎬᏩᏂᎵᏅᏨᎯ ᏅᏓᎬᏩᎴᏅᏛ, ᏅᏩᏍᏗᏉ ᏂᎦᎥ ᎪᎱᏍᏗ ᏥᏄᏍᏛᏉ ᏧᏓᎴᏅᎲ ᎤᏬᏢᏅᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ.

source: But in taking this view they put out of their minds the memory that in the old days there was a heaven, and an earth lifted out of the water and circled by water, by the word of God;
chr: ᎯᎠᏰᏃ ᎤᏅᏒ ᎤᎾᏚᎸᏛ ᎾᏂᎦᏔᎲᎾ ᏥᎩ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏁᏨ ᏅᏧᎵᏍᏙᏔᏅ ᎦᎸᎶ ᎢᎸᎯᏳ ᏥᎨᏎᎢ ᎠᎴ ᎡᎶᎯ ᎠᎹᏱ ᎦᏚ ᏧᎦᏚᏕᎢ, ᎠᎴ ᎠᏭᎯ ᏥᎦᏙᎨᎢ;

source: And that the world which then was came to an end through the overflowing of the waters.
chr: ᎾᏍᎩ ᎡᎶᎯ ᎾᎯᏳ ᏥᎨᏎ ᎠᎹᏱᎭ ᏥᏄᎵᏍᏔᏁᎢ, ᎤᏲᏤᎢ.

source: But the present heaven and the present earth have been kept for destruction by fire, which is waiting for them on the day of the judging and destruction of evil men.
chr: ᎠᏎᏃ ᎦᎸᎶᎢ ᎠᎴ ᎡᎶᎯ ᎪᎯ ᏥᎩ, ᎾᏍᎩᏉ ᎤᏁᏨ ᏅᏗᎦᎵᏍᏙᏗᎭ ᏓᏍᏆᏂᎪᏗ, ᎠᏥᎸᏱ ᏭᎾᎵᏰᎢᎶᎯᏍᏗᏱ ᏓᏍᏆᏂᎪᏗ ᎬᏂ ᏗᎫᎪᏙᏗᏱ ᎢᎦ ᎨᏎᏍᏗ ᎠᎴ ᎨᏥᏛᏙᏗᏱ ᎠᏂᏍᎦᏯ ᎤᏁᎳᏅᎯ ᏂᏚᎾᏁᎶᏛᎾ.

source: But, my loved ones, keep in mind this one thing, that with the Lord one day is the same as a thousand years, and a thousand years are no more than one day.
chr: ᎠᏎᏃ ᎢᏨᎨᏳᎢ, ᎯᎠ ᎾᏍᎩ ᏑᏓᎴᎩ ᏞᏍᏗ ᏂᏥᎦᏔᎲᎾᏉ ᏱᎨᏎᏍᏗ, ᎾᏍᎩ ᏌᏉ ᎢᎦ ᎨᏒ ᎤᎬᏫᏳᎯ ᏙᏗᎧᏂᏍᎬ ᏌᏉ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᎤᏠᏱ, ᏌᏉᏃ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᏌᏉ ᎢᎦ ᎨᏒ ᎤᏠᏱ.

source: The Lord is not slow in keeping his word, as he seems to some, but he is waiting in mercy for you, not desiring the destruction of any, but that all may be turned from their evil ways.
chr: ᎤᎬᏫᏳᎯ ᎥᏝ ᎤᏍᎦᏃᎵᏳ ᏱᎩ ᏄᏍᏛ ᎤᏚᎢᏍᏔᏅ ᎢᏳᏛᏁᏗᏱ, ᎾᏍᎩ ᎩᎶ ᎾᏍᎦᏃᎳ ᏣᏁᎵᎭ, ᎬᏂᏗᏳᏍᎩᏂ ᎠᏴ ᎢᎩᎦᏘᏴᎢ, ᏄᏚᎵᏍᎬᎾ ᎨᏒ ᎩᎶ ᎤᏲᎱᎯᏍᏗᏱ, ᏂᎦᏗᏳᏍᎩᏂ ᎤᏂᎷᎯᏍᏗᏱ ᎦᏁᏟᏴᏍᏗ ᎨᏒ ᎣᏓᏅᏛᎢ.

source: But the day of the Lord will come like a thief; and in that day the heavens will be rolled up with a great noise, and the substance of the earth will be changed by violent heat, and the world and everything in it will be burned up.
chr: ᎤᎬᏫᏳᎯᏍᎩᏂ ᎤᏤᎵ ᎢᎦ ᎠᏎ ᏓᎦᎷᏥ ᎾᏍᎩᏯ ᎦᏃᏍᎩᏍᎩ ᏒᏃᏱ ᏥᎦᎷᎪᎢ, ᎾᎯᏳ ᎦᎸᎶᎢ ᏓᎦᎶᏐᏂ ᎤᏣᏘ ᎤᏃᏴᎨᏍᏗ, ᎪᏢᏔᏅᎯᏃ ᎠᏓᏪᎵᎩᏍᎬ ᏛᎪᏂ, ᎠᎴ ᎡᎶᎯ ᎾᎿᏃ ᎪᏢᏅᏅᎯ ᎨᏒ ᎠᎪᎲᏍᏙᏗ ᎨᏎᏍᏗ.

source: Seeing then that all these things are coming to such an end, what sort of persons is it right for you to be, in all holy behaviour and righteousness,
chr: ᎾᏍᎩᏃ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ ᎤᏗᏒᎲᏍᏗ ᏥᎩ, ᏂᎦᎥ ᏂᏥᏍᎦᏅᎾ ᏱᎩ ᎢᏣᎴᏂᏙᎲᎢ ᎠᎴ ᎤᏁᎳᏅᎯ ᎦᎾᏰᎯᏍᏗ ᎨᏒ ᎢᏤᎲᎢ!

source: Looking for and truly desiring the coming of the day of God, when the heavens will come to an end through fire, and the substance of the earth will be changed by the great heat?
chr: ᏱᏥᎦᏖᏃᎭ ᎠᎴ ᎤᏣᏘ ᏱᏣᏚᎵᎭ ᎤᎷᎯᏍᏗᏱ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎢᎦ, ᎾᎯᏳ ᎦᎸᎶ ᎤᏥᏍᏢ ᏨᏛᏗᏒᏂ, ᎠᎴ ᎾᏍᎩ ᎪᏢᏔᏅᎯ ᎠᏓᏪᎵᎩᏍᎬ ᏛᏗᏌᏂ.

source: But having faith in his word, we are looking for a new heaven and a new earth, which will be the resting-place of righteousness.
chr: ᎠᏎᏃ ᎾᏍᎩᏯ ᏄᏍᏛ ᎤᏚᎢᏍᏔᏅ ᎢᏗᎦᏖᏃᎭ ᎢᏤ ᎦᎸᎶᎢ ᎠᎴ ᎢᏤ ᎡᎶᎯ ᎾᎿ ᎡᎲ ᏚᏳᎪᏛ ᎨᏒᎢ.

source: For this reason, my loved ones, as you are looking for these things, take great care that when he comes you may be in peace before him, free from sin and every evil thing.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ, ᎢᏨᎨᏳᎢ, ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ ᏥᏥᎦᏖᏃᎭ, ᎢᏣᏟᏂᎬᏏ ᎾᏍᎩ ᏅᏩᏙᎯᏯᏛ ᎢᏨᏓᏅᏛ ᎢᏥᏩᏛᏗᏱ ᏄᏓᏓᎸᎾ ᎠᎴ ᎪᎱᏍᏗ ᏁᏤᎵᏎᎲᎾ.

source: And be certain that the long waiting of the Lord is for salvation; even as our brother Paul has said in his letters to you, from the wisdom which was given to him;
chr: ᎾᏍᎩᏃ ᎬᏂᏗᏳ ᎨᏒ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵᎦ ᎠᎵᏍᏕᎸᏙᏗ ᎢᏥᏰᎸᏎᏍᏗ; ᎾᏍᎩᏯ ᎾᏍᏉ ᎡᏗᎨᏳᎢ ᎢᏓᎵᏅᏟ ᏉᎳ ᎬᏗᏍᎬ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎠᏥᏁᎸ ᏥᏦᏪᎳᏁᎸ;

source: And as he said in all his letters, which had to do with these things; in which are some hard sayings, so that, like the rest of the holy Writings, they are twisted by those who are uncertain and without knowledge, to the destruction of their souls.
chr: ᎠᎴ ᎾᏍᏉ ᏂᎦᏛ ᎾᏍᎩ ᏧᏬᏪᎳᏅᎯ ᎾᏍᎩ ᏂᏕᎬᏁᎰ ᎧᏁᎢᏍᏗᏍᎪ ᎾᏍᎩ ᎯᎠ ᏧᏓᎴᏅᏛ; ᎾᎿ ᎤᏓᏑᏯ ᎢᎦᏛ ᎠᏍᏓᏱᏳ ᎪᎵᏍᏗᏱ, ᎾᏍᎩ Ꮎ ᏂᏭᎾᏕᎶᏆᎥᎾ ᎠᎴ ᏗᏂᏩᎾᎦᎳ ᏓᏂᏁᏟᏴᎭ, ᎾᏍᎩᏯ ᎾᏍᏉ ᏗᏐᎢ ᎪᏪᎵ ᏂᏓᏅᏁᎲᎢ, ᎤᏅᏒᏉ ᎤᏂᏛᏗᏍᎩ ᎨᏒᎢ.

source: For this reason, my loved ones, having knowledge of these things before they take place, take care that you are not turned away by the error of the uncontrolled, so falling from your true faith.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏂᎯ ᎢᏨᎨᏳᎢ, ᎾᏍᎩ ᎦᏳᎳ ᏥᏥᎦᏔᎭ, ᎢᏤᏯᏔᎮᏍᏗ, ᏞᏍᏗ ᎠᏂᎾᎦᎾ ᎤᏂᎵᏓᏍᏔᏅ ᏕᏣᏘᏂᏒ ᏗᏥᏅᏨᎩ ᏗᏥᏲᏒᎩ ᎤᎵᏂᎩᏛ ᏂᏣᏛᏅᎢ.

source: But be increased in grace and in the knowledge of our Lord and Saviour Jesus Christ. May he have glory now and for ever. So be it.
chr: ᎢᏥᏁᏉᎨᏍᏗᏍᎩᏂ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎤᎬᏩᎵ ᎠᎴ ᎡᏥᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᎠᎴ ᎢᎩᏍᏕᎵᏍᎩ ᏥᏌ ᎦᎶᏁᏛ; ᎾᏍᎩ ᎦᎸᏉᏙᏗ ᎨᏎᏍᏗ ᎪᎯ ᎨᏒ, ᎠᎴ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ. ᎡᎺᏅ.

source: First Epistle of John
chr: ᏣᏂ ᎢᎬᏱᏱ ᎤᏬᏪᎳᏅᎯ

source: That which was from the first, which has come to our ears, and which we have seen with our eyes, looking on it and touching it with our hands, about the Word of life
chr: ᎾᏍᎩ ᏗᏓᎴᏂᏍᎬ ᏤᎮᎢ, ᎠᏴ ᎣᎦᏛᎦᏅᎯ, ᏦᏥᎦᏙᎵ ᏦᎬᏔᏅᎯ ᎣᎩᎪᎲᎯ, ᎾᏍᎩ ᏦᎦᎧᎿᏅᎯ, ᎠᎴ ᏦᎪᏰᏂ ᏦᎬᏔᏅᎯ ᎣᎦᏒᏂᎵᏙᎸᎯ, ᎧᏃᎮᏛ ᎬᏂᏛ^

source: (And the life was made clear to us, and we have seen it and are witnessing to it and giving you word of that eternal life which was with the Father and was seen by us);
chr: ᎬᏂᏛᏰᏃ ᎬᏂᎨᏒ ᏄᎵᏍᏔᏅᎩ, ᎠᎴ ᎣᎩᎪᎲᎩ, ᎠᎴ ᎣᏥᏃᎮᎭ, ᎠᎴ ᎢᏨᎾᏄᏫᏎᎭ ᎾᏍᎩ ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᎬᏂᏛ, ᎾᏍᎩ ᎠᎦᏴᎵᎨᎢ ᎡᎲ ᏤᎮᎢ, ᎠᎴ ᎬᏂᎨᏒ ᎢᏲᎬᏁᎸᎯ ᏥᎩ^

source: We give you word of all we have seen and everything which has come to our ears, so that you may be united with us; and we are united with the Father and with his Son Jesus Christ:
chr: ᎾᏍᎩ Ꮎ ᎣᎩᎪᎲᎯ ᎠᎴ ᎣᎦᏛᎦᏅᎯ ᎨᏒ ᎢᏨᎾᏄᏫᏎᎭ, ᎾᏍᏉ ᏂᎯ ᎢᏣᏖᎳᏗᏍᏗᏱ ᎣᎦᏚᏓᏕᏫᏒᎢ; ᎠᎴ ᎤᏙᎯᏳᎯᏯ ᎣᎦᏚᏓᏕᏫᏒ ᎠᎦᏴᎵᎨᎢ ᎠᎴ ᎤᏪᏥ ᏥᏌ ᎦᎶᏁᏛ.

source: And we are writing these things to you so that our joy may be made complete.
chr: ᎯᎠ ᎠᎴ ᎾᏍᎩ ᎢᏨᏲᏪᎳᏁᎭ ᎢᏣᎵᎮᎵᎬ ᎤᎧᎵᎢᏍᏗᏱ.

source: This is the word which came to us from him and which we give to you, that God is light and in him there is nothing dark.
chr: ᎯᎠᏃ ᎾᏍᎩ ᎧᏃᎮᏛ ᎣᏣᏛᎦᏁᎸᎯ ᏥᎩ ᎠᎴ ᏥᏨᎾᏄᏫᏎᎭ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎢᎦᎦᏘ ᎨᏒᎢ, ᎠᎴ ᎤᏍᏗ ᎤᏅᎤᎵᏏᎩ ᏄᏪᎲᎾ ᎨᏒᎢ.

source: If we say we are joined to him, and are walking still in the dark, our words are false and our acts are untrue:
chr: ᎢᏳᏃ ᎾᏍᎩ ᏙᎦᏚᏓᏔ ᏱᏓᏗᎭ, ᎤᎵᏏᎬᏃ ᏱᏕᏙᎭ, ᏱᏓᏥᎪᎥᏍᎦᏉ ᎠᎴ ᎥᏝ ᏱᎨᏗᏍᏓᏩᏕᎦ ᎤᏙᎯᏳᎯ ᎨᏒᎢ.

source: But if we are walking in the light, as he is in the light, we are all united with one another, and the blood of Jesus his Son makes us clean from all sin.
chr: ᎢᎦᎦᏛᏍᎩᏂ ᏱᏕᏙᎭ, ᎾᏍᎩᏯ ᎾᏍᎩ ᎢᎦᎦᏛᎢ ᏤᎭ, ᏕᎦᏚᏓᏕᏫᏒ ᎢᎬᏒ ᎨᏒᎢ; ᎠᎴ ᎤᏪᏥ ᏥᏌ ᎦᎶᏁᏛ ᎤᎩᎬ ᎢᎩᏅᎦᎵᎭ ᏂᎦᎥ ᎢᎩᏍᎦᏅᏨᎢ.

source: If we say that we have no sin, we are false to ourselves and there is nothing true in us.
chr: ᎢᏳᏃ ᎥᏝ ᎠᏍᎦᏂ ᏲᎨᎭ ᏱᏓᏗᎭ, ᎢᎬᏒ ᏱᏓᏓᎵᏓᏍᏗᎭ, ᎠᎴ ᎥᏝ ᏱᎨᎨᎭ ᎤᏙᎯᏳᎯ ᎨᏒᎢ.

source: If we say openly that we have done wrong, he is upright and true to his word, giving us forgiveness of sins and making us clean from all evil.
chr: ᎢᏳᏃ ᏱᏗᏃᎲᏍᎦ ᎢᎩᏍᎦᏅᏨᎢ, ᏄᏓᎵᏓᏍᏛᎾ ᎠᎴ ᎤᏓᏅᏘᏳ, ᎾᏍᎩ ᎢᎩᏁᏗᏱ ᎢᎩᏍᎦᏅᏨᎢ, ᎠᎴ ᎢᎩᏅᎦᎸᏗᏱ ᏂᎦᎥ ᎤᏲ ᏗᎦᎸᏫᏍᏓᏗ ᎨᏒᎢ.

source: If we say that we have no sin, we make him false and his word is not in us.
chr: ᎢᏳᏃ ᎥᏝ ᏲᎩᏍᎦᏅᏨ ᏱᏓᏗᎭ, ᎡᏗᏰᎪᎥᏍᎦᏉ, ᎠᎴ ᎧᏃᎮᏛ ᎤᏤᎵᎦ ᎥᏝ ᏱᎨᎨᎭ.

source: My little children, I am writing these things to you so that you may be without sin. And if any man is a sinner, we have a friend and helper with the Father, Jesus Christ, the upright one:
chr: ᏗᏥᏲᎵ ᏗᏇᏥ, ᎯᎠ ᎾᏍᎩ ᎢᏨᏲᏪᎳᏁᎭ, ᎢᏥᏍᎦᏅᎢᏍᏗᏱ ᏂᎨᏒᎾ. ᎢᏳᏃ ᎩᎶ ᏯᏍᎦᏅᎦ, ᎢᎨᎭ ᏗᎪᎯᏍᏓᏁᎯ ᎠᎦᏴᎵᎨ ᎡᎲᎢ, ᏥᏌ ᎦᎶᏁᏛ ᎾᏍᎦᏅᎾ.
